In [9]:
import pandas as pd
df_churn = pd.read_csv('churn.csv', index_col='RowNumber')
df_churn.head(10)

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,,,
1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
5,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
6,15574012,Chu,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
7,15592531,Bartlett,822,France,Male,50,7,0.00,2,1,1,10062.80,0
8,15656148,Obinna,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
9,15792365,He,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
10,15592389,H?,684,France,Male,27,2,134603.88,1,1,1,71725.73,0

In [8]:
df_churn.Geography.value_counts() # Verificando quais são os países da mostra e quantos dados tem de cada um.

France     5014
Germany    2509
Spain      2477
Name: Geography, dtype: int64

In [11]:
arr_delete = ['CustomerId', 'Surname'] # Criando arrei de colunas que não são interessantes para a analise.

df_churn.drop(arr_delete, axis=1, inplace = True) # Usando o drop() para deletar colunas que foram selecionadas no arrei.
df_churn.head(10) # Novo data frame sem as colunas.

,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
RowNumber,,,,,,,,,,,
1,619,France,Female,42,2,0.00,1,1,1,101348.88,1
2,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
3,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
4,699,France,Female,39,1,0.00,2,0,0,93826.63,0
5,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
6,645,Spain,Male,44,8,113755.78,2,1,0,149756.71,1
7,822,France,Male,50,7,0.00,2,1,1,10062.80,0
8,376,Germany,Female,29,4,115046.74,4,1,0,119346.88,1
9,501,France,Male,44,4,142051.07,2,0,1,74940.50,0
10,684,France,Male,27,2,134603.88,1,1,1,71725.73,0

In [12]:
df_churn.info() # Verificando o tipo das informações do data frame

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 1 to 10000
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CreditScore      10000 non-null  int64
 1   Geography        10000 non-null  object
 2   Gender           10000 non-null  object
 3   Age              10000 non-null  int64
 4   Tenure           10000 non-null  int64
 5   Balance          10000 non-null  float64
 6   NumOfProducts    10000 non-null  int64
 7   HasCrCard        10000 non-null  int64
 8   IsActiveMember   10000 non-null  int64
 9   EstimatedSalary  10000 non-null  float64
 10  Exited           10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 937.5+ KB

### 2. Separando as Features qualitativas e quantitativas.

In [13]:
# Criando duas listas com colunas consideradas qualitativas ou quantitativas.

qualitativas = ['Geography', 'Gender', 'HasCrCard', 'IsActiveMember', 'Exited']
quantitativas = ['CreditScore', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'EstimatedSalary', 'Exited']

df_churn_qualita = df_churn[qualitativas]
df_churn_quantita = df_churn[quantitativas]

In [14]:
df_churn_qualita.head(10)

          Geography  Gender  HasCrCard  IsActiveMember  Exited
RowNumber
1            France  Female          1               1       1
2             Spain  Female          0               1       0
3            France  Female          1               0       1
4            France  Female          0               0       0
5             Spain  Female          1               1       0
6             Spain    Male          1               0       1
7            France    Male          1               1       0
8           Germany  Female          1               0       1
9            France    Male          0               1       0
10           France    Male          1               1       0

In [16]:
df_churn_quantita.head(10)

,CreditScore,Age,Tenure,Balance,NumOfProducts,EstimatedSalary,Exited
RowNumber,,,,,,,
1,619,42,2,0.00,1,101348.88,1
2,608,41,1,83807.86,1,112542.58,0
3,502,42,8,159660.80,3,113931.57,1
4,699,39,1,0.00,2,93826.63,0
5,850,43,2,125510.82,1,79084.10,0
6,645,44,8,113755.78,2,149756.71,1
7,822,50,7,0.00,2,10062.80,0
8,376,29,4,115046.74,4,119346.88,1
9,501,44,4,142051.07,2,74940.50,0
10,684,27,2,134603.88,1,71725.73,0

### 3. Nas Features quantitativas fazer os estudos estatísticos para compreender a distribuição dos dados.

In [18]:
df_churn_quantita.describe().round(0)

,CreditScore,Age,Tenure,Balance,NumOfProducts,EstimatedSalary,Exited
count,10000.0,10000.0,10000.0,10000.0,10000.0,10000.0,10000.0
mean,651.0,39.0,5.0,76486.0,2.0,100090.0,0.0
std,97.0,10.0,3.0,62397.0,1.0,57510.0,0.0
min,350.0,18.0,0.0,0.0,1.0,12.0,0.0
25%,584.0,32.0,3.0,0.0,1.0,51002.0,0.0
50%,652.0,37.0,5.0,97199.0,1.0,100194.0,0.0
75%,718.0,44.0,7.0,127644.0,2.0,149388.0,0.0
max,850.0,92.0,10.0,250898.0,4.0,199992.0,1.0